tap "asmvik/formulae"
tap "azure/functions"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "koekeishiya/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "lgug2z/tap"
tap "nikitabobko/tap"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GitHub command-line tool
brew "gh"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@17"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# Cross-shell prompt for astronauts
brew "starship"
# UNIX shell (command interpreter)
brew "zsh"
# Gestor de ventanas en mosaico para macOS (komorebi-for-mac).
# Aporta el CLI 'komorebic' en el PATH (lo usan skhd y rset). El binario
# 'komorebi' que se ejecuta es mi build personal con ajustes (ver install.sh).
brew "lgug2z/tap/komorebi-for-mac"
# Toolchain de Rust (cargo) para compilar mi fork de komorebi-for-mac
brew "rust"
# Daemon de atajos de teclado (lanza los comandos komorebic)
brew "asmvik/formulae/skhd"
# Bordes de la ventana activa (JankyBorders)
brew "felixkratz/formulae/borders"
# Digital signature editor and validator
cask "autofirma"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
cask "font-hack-nerd-font"
cask "font-sketchybar-app-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Cloud storage client
cask "onedrive"
# Replacement for Docker Desktop
cask "orbstack"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Control your tools with a few keystrokes
cask "raycast"
# .NET IDE
cask "rider"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "aaron-bond.better-comments"
vscode "adrianwilczynski.add-reference"
vscode "adrianwilczynski.asp-net-core-switcher"
vscode "adrianwilczynski.blazor-snippet-pack"
vscode "adrianwilczynski.csharp-to-typescript"
vscode "adrianwilczynski.libman"
vscode "adrianwilczynski.namespace"
vscode "adrianwilczynski.terminal-commands"
vscode "adrianwilczynski.toggle-hidden"
vscode "adrianwilczynski.user-secrets"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "docker.docker"
vscode "doggy8088.netcore-editorconfiggenerator"
vscode "doggy8088.netcore-extension-pack"
vscode "doggy8088.netcore-snippets"
vscode "doggy8088.quicktype-refresh"
vscode "drblury.protobuf-vsc"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.dotnet"
vscode "github.github-vscode-theme"
vscode "heaths.vscode-guid"
vscode "hoovercj.vscode-power-mode"
vscode "hsnazar.hyper-term-theme"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jmrog.vscode-nuget-package-manager"
vscode "josefpihrt-vscode.roslynator"
vscode "k--kato.docomment"
vscode "kreativ-software.csharpextensions"
vscode "lewxdev.vscode-glyph"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "nichabosh.minimalist-dark"
vscode "oven.bun-vscode"
vscode "patcx.vscode-nuget-gallery"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "postman.postman-for-vscode"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "richardwillis.vscode-entity-framework"
vscode "ritwickdey.liveserver"
vscode "sidthesloth.html5-boilerplate"
vscode "silasnevstad.gpthelper"
vscode "tintoy.msbuild-project-tools"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
